<?php
// +----------------------------------------------------------------------
// | ZL [ WE CAN DO IT！！！]
// +----------------------------------------------------------------------
// | Copyright (c) 2016~2018 Z.L All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( NO )
// +----------------------------------------------------------------------
// | Author: Z.L <582152734@qq.com>
// +----------------------------------------------------------------------

//连接数据库操作

$dsn='mysql:host=localhost;dbname=newsdemo';

$dbuser='root';
$dbpwd='root';
try {
	$conn=new PDO($dsn,$dbuser,$dbpwd);
} catch (PDOException $e) {
	exit('Could not connect the database:<br>'.$e);
}

